[Imprinted.A_Resurrection_Imprinted H7HeroAbility]
mName="转世重生"
mTooltip="立即治疗并复活目标友方生物 %d.min 点生命值。目标生物在 %buff1.buff.durini 回合内，治疗并复活所有相邻友方生物 %buff1.buff.d.min 点生命值。\n（不受影响：亡灵和构造体）"

[A_ChosenOfTheLight_Buff H7BaseBuff]
mName="圣光之选"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御\n%stat4 %ICON_MORALE 士气\n%stat3 %ICON_LUCK 幸运\n该生物总是造成最大伤害。\n持续 %durnow 回合。"

[Imprinted.A_CelestialArmor_Imprinted_Buff H7BaseBuff]
mName="天国护甲"
mTooltip="吸收最多 %special.val3 点伤害。\n持续 %durnow 回合或直到所有伤害被吸收。"

[A_ElrathsConviction_Buff H7BaseBuff]
mName="光龙信念"
mTooltip="%stat1 %ICON_DEFENSE 防御\n%stat2 %ICON_LEADERSHIP 领导力\n持续 %durnow 场战斗。"

[A_Bedazzled_Buff H7BaseBuff]
mName="迷惑大法"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御\n持续 %durnow 回合。"

[A_ElrathsConviction H7HeroAbility]
mTooltipMagicGuild="提升英雄下場戰鬥的 %ICON_DEFENSE 防御和 %ICON_LEADERSHIP 领导力。"
mTooltipMagicGuildRankLine="%buff.buff.stat1 %buff.buff.stat1.icon 防御 和 %buff.buff.stat2 %buff.buff.stat2.icon 领导力"
mName="光龙信念"
mTooltip="提升英雄下場戰鬥的 %ICON_DEFENSE 防御 %buff.buff.stat1.norm 和 %ICON_LEADERSHIP 领导力 %buff.buff.stat2.norm。"

[A_Bedazzled_FromCreature_Buff_Elite H7BaseBuff]
mName="迷惑大法"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御\n持续 %durnow 回合。"

[A_SunBeam H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 光系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %ICON_LIGHT"
mTooltipUpgraded="立即对目标敌方单位造成 %d.min 到 %d.max %ICON_LIGHT 光系伤害，并降低其 %ICON_ATTACK 攻击 和 %ICON_DEFENSE 防御 %buff.buff.stat1.norm，持续 %buff.buff.durini 回合。"
mName="阳炎激射"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 光系伤害。"



[A_Resurrection_Buff H7BaseBuff]
mName="光龙之触"
mTooltip="在其回合开始时，治疗并复活所有相邻友方生物 %d.min 点生命值。\n（不受影响：亡灵和构造体）\n持续 %durnow 回合。"

[A_CelestialArmor_Buff H7BaseBuff]
mName="天国护甲"
mTooltip="吸收最多 %special.val3 点伤害。\n持续 %durnow 回合或直到所有伤害被吸收。"

[A_CelestialArmor H7HeroAbility]
mTooltipMagicGuild="吸收目标友方生物的伤害，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.special.val1 伤害吸收"
mTooltipUpgraded="吸收目标3x3区域内所有友方生物最多 %buff1.buff.special.val1 点伤害，持续 %buff1.buff.durini 回合。"
mName="天国护甲"
mTooltip="吸收目标友方生物最多 %buff1.buff.special.val1 点伤害，持续 %buff1.buff.durini 回合。"

[Imprinted.A_CelestialArmor_Imprinted H7HeroAbility]
mName="天国护甲"
mTooltip="吸收目标友方生物最多 %buff1.buff.special.val1 点伤害，持续 %buff1.buff.durini 回合。"

[A_Bedazzled_FromCreature_Buff_Champion H7BaseBuff]
mName="迷惑大法"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御\n持续 %durnow 回合。"

[A_SunBurst H7HeroAbility]
mTooltipMagicGuild="对从目标点向8个方向发出的8条射线击中的敌方单位造成 %d.icon 光系伤害。单位和障碍物会阻挡射线。目标点必须是空闲格子。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %ICON_LIGHT"
mTooltipUpgraded="对从目标点向8个方向发出的8条射线击中的敌方单位造成 %d.min 到 %d.max %ICON_LIGHT 光系伤害。被击中的生物的 %ICON_ATTACK 攻击 和 %ICON_DEFENSE 防御降低 %buff.buff.stat1.norm，持续 %buff.buff.durini 回合。单位和障碍物会阻挡射线。目标点必须是空闲格子。"
mName="阳炎爆射"
mTooltip="对从目标点向8个方向发出的8条射线击中的敌方单位造成 %d.min 到 %d.max %d.icon 光系伤害。单位和障碍物会阻挡射线。目标点必须是空闲格子。"

[A_CleansingLight H7HeroAbility]
mTooltipMagicGuild="立即从目标友方生物移除一定数量的负面魔法效果。"
mTooltipMagicGuildRankLine="%special1 个效果 和 %special4 %ICON_MANA 法力消耗"
mTooltipUpgraded="立即从目标4x4区域内所有友方生物移除 %special1 个负面魔法效果。"
mName="净化之光"
mTooltip="立即从目标友方生物移除 %special1 个负面魔法效果。"

[A_Retribution_Buff H7BaseBuff]
mName="惩戒之术"
mTooltip="对攻击此生物的每个生物造成 %d.min 到 %d.max %d.icon 光系伤害。持续 %durnow 回合。"

[Imprinted.A_CleansingLight_Imprinted H7HeroAbility]
mName="净化之光"
mTooltip="立即从目标友方生物移除 %special1 个负面魔法效果。"

[Imprinted.A_ElrathsConviction_Imprinted H7HeroAbility]
mName="光龙信念"
mTooltip="提升英雄下場戰鬥的 %ICON_DEFENSE 防御 %buff.buff.stat1.norm 和 %ICON_LEADERSHIP 领导力 %buff.buff.stat2.norm。"

[Imprinted.A_ElrathsConviction_Imprinted_Buff H7BaseBuff]
mName="光龙信念"
mTooltip="%stat1 %ICON_DEFENSE 防御\n%stat2 %ICON_LEADERSHIP 领导力\n持续 %durnow 场战斗。"


[Imprinted.A_Resurrection_Imprinted_Buff H7BaseBuff]
mName="光龙之触"
mTooltip="在其回合开始时，治疗并复活所有相邻友方生物 %d.min 点生命值。\n（不受影响：亡灵和构造体）\n持续 %durnow 回合。"

[Imprinted.A_Retribution_Imprinted H7HeroAbility]
mName="惩戒之术"
mTooltip="对攻击目标友方生物的每个生物造成 %buff1.buff.d.min 到 %buff1.buff.d.max %buff1.buff.d.icon 光系伤害。持续 %buff1.buff.durini 回合。"

[Imprinted.A_Retribution_Imprinted_Buff H7BaseBuff]
mName="惩戒之术"
mTooltip="对攻击此生物的每个生物造成 %d.min 到 %d.max %d.icon 光系伤害。持续 %durnow 回合。"

[Imprinted.A_SummonGoldDragon_Imprinted H7HeroAbility]
mName="金龙召唤"
mTooltip="在目标2x2区域召唤 %special.val1 条金龙。"

[Imprinted.A_SummonGoldDragon_Imprinted_Artifact H7HeroAbility]
mName="金龙召唤"
mTooltip="在目标2x2区域召唤 %special.val1 条金龙。"

[Imprinted.A_SunBeam_Imprinted H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 光系伤害。"
mTooltipUpgraded="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 光系伤害。被阳炎激射伤害的生物有 %buff.chance% 的几率被限制为移动和防御，并且直到其下一回合结束前无法反击。"
mName="阳炎激射"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 光系伤害。"

[Imprinted.A_SunBurst_Imprinted H7HeroAbility]
mName="阳炎爆射"
mTooltip="对从目标点向8个方向发出的8条射线击中的敌方单位造成 %d.min 到 %d.max %d.icon 光系伤害。单位和障碍物会阻挡射线。目标点必须是空闲格子。"

[A_Blinded_Buff H7BaseBuff]
mName="致盲"
mTooltip="该生物跳过其下一回合。"

[A_Retribution_Buff_Upgraded H7BaseBuff]
mName="惩戒之术"
mTooltip="对攻击此生物的每个生物造成 %d.min 到 %d.max %d.icon 光系伤害。持续 %durnow 回合。"

[Imprinted.A_Martyr_Imprinted_Buff_MartyrAdoration H7BaseBuff]
mName="殉道崇拜"
mTooltip="%stat %icon_leadership 士气。只要存在另一个带有殉道增益的友方生物就持续。"

[A_Martyr_Buff_MartyrAdoration H7BaseBuff]
mName="殉道崇拜"
mTooltip="%stat %icon_leadership 士气。只要存在另一个带有殉道增益的友方生物就持续。"

UCP 1.1 

[A_Martyr_Buff_Martyr H7BaseBuff]
mName="殉道祝福"
mTooltip="任何其他友方生物将受到的非魔法伤害的 %buff1.buff.special1 被重定向到此生物。持续 %durnow 战斗回合。"

[Imprinted.A_Martyr_Imprinted_Artifact H7HeroAbility]
mName="殉道祝福"
mTooltip="目标友方生物成为殉道者。每当任何其他友方生物受到非魔法伤害时，该伤害的 %buff1.buff.buff1.buff.special1 被重定向至殉道者。所有其他生物拥有 %buff1.buff.buff1.buff.stat %icon_leadership 士气。持续 %buff1.buff.durini 战斗回合或直到殉道者死亡。"

[Imprinted.A_Martyr_Imprinted_Buff_Martyr H7BaseBuff]
mName="殉道祝福"
mTooltip="任何其他友方生物将受到的非魔法伤害的 %buff1.buff.special1 被重定向到此生物。持续 %durnow 战斗回合。"



[Imprinted.A_Martyr_Imprinted H7HeroAbility]
mName="殉道祝福"
mTooltip="目标友方生物成为殉道者。每当任何其他友方生物受到非魔法伤害时，该伤害的 %buff1.buff.buff1.buff.special1 被重定向至殉道者。所有其他生物拥有 %buff1.buff.buff1.buff.stat %icon_leadership 士气。持续 %buff1.buff.durini 战斗回合或直到殉道者死亡。"

[Imprinted.A_Heal_Imprinted H7HeroAbility]
mName="疗伤大法"
mTooltip="治疗并复活目标友方生物 %d1.min 点生命值。\n（不受影响：亡灵和构造体）"


UCP 1.1 New Effect

[Imprinted.A_Resurrection_Imprinted_Artefact H7HeroAbility]
mName="转世重生"
mTooltip="立即治疗并复活目标友方生物 %d.min 点生命值。目标生物在 %buff1.buff.durini 回合内，治疗并复活所有相邻友方生物 %buff1.buff.d.min 点生命值。（不受影响：亡灵和构造体）"


7.5_mod :


[rework1.A_Regeneration H7HeroAbility]
mTooltipMagicGuild="治疗并复活目标友方生物。\n（不受影响：亡灵和构造体）"
mTooltipMagicGuildRankLine="%d1.min 生命值 %icon_light"
mTooltipUpgraded="治疗并复活目标4x4区域内所有友方生物 %d1.min 点生命值。\n（不受影响：亡灵和构造体）"
mName="疗伤大法"
mTooltip="治疗并复活目标友方生物 %d1.min 点生命值。\n（不受影响：亡灵和构造体）"

[A_Heal_campag H7HeroAbility]
mTooltipMagicGuild="治疗并复活目标友方生物 %d1.min 点生命值。"
mTooltipMagicGuildRankLine="%d1.min 生命值"
mTooltipUpgraded="治疗并复活所有友方生物 %d1.min 点生命值。
mName="疗伤大法"
mTooltip="治疗并复活目标友方生物 %d1.min 点生命值。\n（不受影响：亡灵和构造体）"

[A_CelestialArmor_Buff_Upgraded H7BaseBuff]
mName="天国护甲"
mTooltip="吸收目标友方生物最多 %special.val3 点伤害，持续 %durnow 回合。"

v1.33 

[Bless.A_Bless H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="祝福"
mTooltip="目标友方单位总是造成最大伤害（亡灵和构造体除外）。持续 %buff.buff.durini 回合。"

v1.35

[Rework.A_Burningdetermination H7HeroAbility]
mTooltipMagicGuild="吸收目标友方生物的伤害，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.special.val1 伤害吸收"
mTooltipUpgraded="吸收目标3x3区域内所有友方生物最多 %buff1.buff.special.val1 点伤害，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="天国护甲"
mTooltip="吸收目标友方生物最多 %buff1.buff.special.val1 点伤害，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"

[A_Retribution H7HeroAbility]
mTooltipMagicGuild="对攻击目标友方生物的每个生物造成 %buff1.buff.d.icon 光系伤害。持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.d.min 到 %buff1.buff.d.max %buff1.buff.d.icon"
mTooltipUpgraded="对目标4x4区域内所有友方生物施放 %spell.name。攻击它们的敌方生物受到 %buff1.buff.d.min 到 %buff1.buff.d.max %buff1.buff.d.icon 光系伤害。持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="惩戒之术"
mTooltip="对攻击目标友方生物的每个生物造成 %buff1.buff.d.min 到 %buff1.buff.d.max %buff1.buff.d.icon 光系伤害。持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"

v1.37

[Rework1.A_Burningdetermination H7HeroAbility]
mTooltipMagicGuild="目标友方生物成为殉道者。每当任何其他友方生物受到非魔法伤害时，该伤害的一定百分比被重定向至殉道者。所有其他生物拥有 %buff1.buff.buff1.buff.stat %icon_leadership 士气。持续 %buff1.buff.durini 战斗回合或直到殉道者死亡。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff1.buff.buff1.buff.special1 伤害重定向"
mName="殉道祝福"
mTooltip="目标友方生物成为殉道者。每当任何其他友方生物受到非魔法伤害时，该伤害的 %buff1.buff.buff1.buff.special1 被重定向至殉道者。所有其他生物拥有 %buff1.buff.buff1.buff.stat %icon_leadership 士气。持续 %buff1.buff.durini 战斗回合或直到殉道者死亡。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[Rework2.A_Regeneration H7HeroAbility]
mTooltipMagicGuild="立即治疗并复活目标友方生物。目标生物在 %buff1.buff.durini 回合内治疗并复活所有相邻友方生物。\n（不受影响：亡灵和构造体）\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d.min 生命值（目标）和 %buff1.buff.d.min 生命值（周围）"
mName="转世重生"
mTooltip="立即治疗并复活目标友方生物 %d.min 点生命值。目标生物在 %buff1.buff.durini 回合内，治疗并复活所有相邻友方生物 %buff1.buff.d.min 点生命值。\n（不受影响：亡灵和构造体）\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"